<template>
  <div class="modal">
    <div class="modal-card">
      <h2 class="modal-head" id="h_user_agreement">최종 사용자 사용권 계약(End User License Agreement)</h2>
      <div class="content">
        <div class="modal-body">
          <p class="tos">- 펜타시큐리티시스템㈜ 제품 이용 약관 -</p><br><br>

          본 제품을 설치하고 사용하기 이전에 다음의 내용을 주의깊게 읽어 주십시오. <br><br><br>

          <p class="tos">전 문</p><br><br><br>

          귀하가 본 제품을 설치, 엑세스 또는 사용함으로써 귀하는 본 계약에 동의하신 것으로 간주되며, 귀하는 본인이 해당 개인 또는 법인에 대해 본 계약의 구속력을 부여할 수 있는 전권이 있음을 표시하고 보증합니다.<br><br>

          본 사용권 계약(이하 "라이선스 계약" 또는 "계약")은 Penta Security Systems Inc.(이하 “[펜타시큐리티]”)가 개발, 배포, 판매하는 본 제품에 대해 본 제품을 사용하고자 하는 개인 또는 법인(이하 “사용자”)과 [펜타시큐리티] 간에 체결하는 계약입니다.<br><br>

          본 계약에 명시된 조항에 동의하지 않을 경우 다음을 수행해야 합니다.<br>
          ● 본 제품 소프트웨어 및 하드웨어를 설치, 액세스 또는 사용하지 마십시오.<br>
          ● 본 제품 소프트웨어 및 하드웨어 구매 관련 증명서를 구입 업체에 반환해 주십시오.<br><br><br>

          <p class="chapter">제1조 [목적]</p><br>

          본 계약은 [펜타시큐리티]가 제공하는 제품을 최종 사용자가 이용함에 있어 필요한 조건 및 절차에 관한 사항과 기타 필요한 사항을 규정함을 목적으로 한다.<br><br><br>

          <p class="chapter">제2조 [용어의 정의]</p><br>

          1. [펜타시큐리티]<br>
          대한민국 서울특별시 영등포구 여의공원로 115 세우빌딩 9층에 본점을 두고 있는 대한민국법에 따라 설립된 법인 펜타시큐리티시스템 주식회사(영문 Penta Security Systems Inc.)를 뜻한다.<br><br>
          2. 제품<br>
          [펜타시큐리티]가 고객에게 판매한 소프트웨어 일체 및 하드웨어와 그 부속품 일체를 의미하며, 그 구체적인 목록은 제품 설치 설명서의 내용을 따른다.<br><br>
          3. 제품관련문서<br>
          위 제품 및 제품의 업데이트, 유지보수 등 행위와 관련된 모든 문서<br><br>
          4. 라이선스(License)<br>
          [펜타시큐리티]가 개발하여 판매하는 본 제품에 대한 사용 허가<br><br>
          5. 고객<br>
          본 계약에 의해 [펜타시큐리티]가 개발하여 판매하는 본 제품을 사용하는 개인 또는 법인, 라이선시(Licensee)<br><br>
          6. 이용자<br>
          위 제5항의 고객 중 본 제품을 통해 아래에서 정의하는 “이용기관”에 PIN, 패턴, 생체정보, QR, OTP, PKI인증서 등(이하 “인증수단”)을 제공하고 이용기관의 서비스에 접속하는 개인 또는 법인<br><br>
          7. 이용기관<br>
          위 제5항의 고객 중 본 제품을 통해 이용자로부터 인증수단을 제공받아 그 합치성 등을 확인하고 이용기관의 서비스에 접속하도록 하는 개인 또는 법인<br><br><br>

          <p class="chapter">제3조 [라이선스 부여]</p><br>

          본 계약에 따라 [펜타시큐리티]는 고객이 사내업무의 목적으로 본 제품을 설치, 실행, 그 외 [펜타시큐리티]가 예정한 통상의 방법으로 사용하는 것(이하 “사용”)에 대해 비독점적, 양도불가의 영구적 라이선스를 고객에 부여한다. 고객은 고객에게 부여된 라이선스 수(본 제품 소프트웨어가 설치되는 장치의 수 또는 고객에게 허여된 본 제품의 사용범위)를 초과하여 본 제품을 사용해서는 아니된다. 특정 공개된 장소에서의 시연 또는 시분할(Time-Sharing) 방식의 제품 사용을 위해 본 계약에 따른 라이선스가 부여된 경우 [펜타시큐리티]는 본 제품의 기능 일부를 제한할 수 있다.<br><br><br>

          <p class="chapter">제4조 [소유권 및 지식재산권]</p><br>

          고객은 본 제품과 본 제품에 대해 가능한 업데이트가 [펜타시큐리티]의 독자적인 기술에 기반한 산출물로서, 그 소유권과 관련 지식재산권 일체가 [펜타시큐리티]에 귀속됨을 확인하고 이에 동의한다. [펜타시큐리티]는 해당 소유권 및 지식재산권 보호 여부를 확인하기 위하여 합리적으로 관련된 정보 또는 기타 자료의 제공을 요구할 수 있으며 고객은 이에 협조하여야 한다.<br><br>

          고객은 아래의 항목을 스스로 이행하지 않으며 제3자가 이를 이행하는 것을 승인하거나 지원하지 않는다.<br><br>
          1. [펜타시큐리티]의 사전 서면동의 없이 제품의 ID 또는 재산권 고지사항을 제거하는 행위<br><br>
          2. 제품을 변경 혹은 복제하거나 다른 컴퓨터 언어(computer language) 혹은 사람의 언어로 번역 또는 옮기는 행위<br><br>
          3. 제품관련문서 또는 그 내용을 복제 또는 제3자가 지득할 수 있는 방식으로 제공하는 행위<br><br>
          4. 제품의 전부 또는 일부에 대해 변경, 복제, 번역, 분해, 재조립, 디컴파일, 디스어셈블, 리버스 엔지니어링, 재패키징을 하거나, 제품의 소스코드 또는 [펜타시큐리티]의 영업비밀 등 영업상 가치있는 정보의 발견 등을 시도하는 행위<br><br>
          5. 제품 및 제품관련문서를 공개된 장소에서 시연용으로 사용하거나 시분할방식(Time-Sharing)으로 사용하는 행위<br><br>
          6. 제품 및 제품의 패키지에 표시된 저작권, 상표 및 그 외의 소유권 관련 통지, 또는 제품에 포함되는 어떠한 관련 항목을 삭제, 변경, 왜곡, 은폐 또는 수정하는 행위<br><br>
          7. 제품에 속하는 상표 혹은 지식재산권, 소유권 등 일체의 권리를 [펜타시큐리티]의 명의에 의하지 않고 임의의 국가에 직/간접적으로 등록하거나, 등록을 시도하거나, 제3자가 등록하는 것을 지원하는 행위<br><br>
          8. 제품 또는 제품에 대한 고객의 권리를 판매, 복사, 양도, 전달, 매각 또는 기타 이전하는 행위<br><br>
          9. 제품을 본래의 용도 이외의 방식 또는 목적으로 사용하는 행위<br><br>
          10. [펜타시큐리티]의 사전 서면승인 없이 제품 및 제품이 사용되는 시스템의 성능, 벤치마크 테스트 결과 또는 그 분석 결과를 공개하는 행위<br><br>
          11. 제품의 파생품을 제작하는 행위<br><br><br>

          <p class="chapter">제5조 [한정 보증 및 보증의 부인]</p><br>

          1. [펜타시큐리티]는 고객이 제품을 수령한 이후 소프트웨어는 60일간, 하드웨어는 1년간 제품관련문서에 명시된 제품의 동작을 보증한다. 본 보증의 내용은, 고객이 보증기간 내 [펜타시큐리티]에 대하여 부적절한 동작의 상세를 통지하고 [펜타시큐리티]에 하자가 있는 제품 소프트웨어를 수정 또는 교환하는 합리적인 기회를 제공하는 것으로 한다. 고객은 본항의 보증과 관련하여 [펜타시큐리티]의 합리적인 지시에 따르는 것에 합의하며, 해당 지시에는 제품의 반품 및 교체도 포함된다. 본항의 보증은 고객이 제품을 제품관련문서의 내용을 따르지 않고 사용하거나, 제품이 악용, 변경, 변조되거나 기타 사고 혹은 자연 재해에 의한 손상을 받은 경우 [펜타시큐리티]의 판단 하에 무효화될 수 있다.<br><br>
          2. [펜타시큐리티]는 제품이 고객의 요구사항을 충족시키는 것, 제품이 중단 없이 작동하는 것, 제품 사용 시 에러가 발생하지 않는 것을 별도의 서면계약 없이는 보증하지 않는다. [펜타시큐리티]는 본조 제1항에 명시한 내용 외에 제품의 부적절한 동작에 대한 기타 보상을 하지 않으며, 고객이 제품을 제품 고유의 기능 이외의 목적으로 사용하거나 [펜타시큐리티]와의 협의 없이 제품 사용 환경을 변경하여 발생하는 제품의 부적절한 동작 및 그에 따른 일체의 위험에 대한 보상을 하지 않는다. 본조 제1항에서 정한 경우를 제외하고 고객은 제품의 품질 및 성능에 관한 일체의 위험을 부담하고, 해당 위험과 관련하여 [펜타시큐리티]가 제공하는 유상/무상의 기술지원 서비스와 관계없는 필요한 보수 및 비용 일체를 부담한다.<br><br>
          3. 고객은 [펜타시큐리티]의 유상 기술지원 서비스를 구입하지 않는 한, 제품 사용 및 제품 사용 환경(소프트웨어 및 하드웨어 구성 일체를 포함한다)에 대한 단독 책임을 부담한다.<br><br><br>

          <p class="chapter">제6조 [지식재산권 대응 및 손해의 배상]</p><br>

          1. 제품과 관련하여 고객에 대해 제3자의 지식재산권에 기반한 청구 또는 소송(이하 '청구 등'이라고 말한다)이 발생하는 경우 고객은 (a)즉시 [펜타시큐리티]에 청구 등의 사실과 그 내용을 서면으로 통지하고, (b)청구의 화해 및 항변에 대해서 [펜타시큐리티]에 완전한 권한 및 지배권을 부여하고, (c) [펜타시큐리티]에 적절한 지원 및 정보를 제공하는 것을 포함해 관련 청구의 항변에 있어서 합리적으로 가능한 한 [펜타시큐리티]에 전면적으로 협력하여야 한다.<br><br>
          2. [펜타시큐리티]는 다음의 사유로 인하여 발생한 고객의 손해와 본조 제1항의 청구 등에 대해서는 어떠한 의무도 지지 않는다. (a)[펜타시큐리티]가 기술지원자로 인정한 사람 이외의 사람에 의한 제품의 변경, (b)고객의 요청에 의해 [펜타시큐리티]가 이행한 변경, (c)본 계약 또는 제품관련문서에 따라 지정된 방법 외의 방법에 의한 제품의 사용, (d)[펜타시큐리티]의 업데이트 권유나 제공에 따르지 않은 구 버전 제품의 사용, (e)제3자의 소프트웨어, 하드웨어 또는 데이터와 조합시킨 제품의 사용, (f)고객이 [펜타시큐리티]와 사전 협의하지 않고 이행한 제품 또는 제품 사용 환경(관련 소프트웨어의 버전 등 제품이 설치된 서버 환경 일체)의 변경, (g)한정적 라이선스 만료에 따른 제품의 전부 또는 일부의 기능/동작 중단<br><br>
          3. 제품과 관련한 고객의 손해배상청구 또는 위 제1항의 청구 등이 발생한 경우 [펜타시큐리티]는 자신의 비용으로 제품에 대한 고객의 사용권을 취득하거나, 청구의 원인을 제공한 문제가 없도록 제품을 수정하거나, 동등한 성능 및 기능을 가지는 다른 제품으로의 교환을 제공할 수 있다. 이 중 어떠한 선택사항도 [펜타시큐리티]가 합리적으로 이행할 수 없는 경우 [펜타시큐리티] 또는 고객은 본 계약을 해지할 수 있고, [펜타시큐리티]는 청구의 원인을 제공한 제품에 대해 3년의 내용연수를 적용한 감가상각비용을 산출하여 최초사용시점부터 사용 종료시점까지의 감가상각비용을 제한 금액을 고객에게 환불한다.<br><br>
          4. 본조의 내용은 [펜타시큐리티]의 모든 의무와 고객의 배타적인 구제를 정한다.<br><br><br>

          <p class="chapter">제7조 [책임한도 및 제한]</p><br>

          1. [펜타시큐리티]와 고객은 어떠한 형태의 결과적, 징벌적, 간접적, 특수한, 우연적 손해(기대이익 상실을 포함)에 대한 배상책임을 부담하지 않는다. 일방 당사자의 손해 발생 가능성이 상대방에게 사전에 통지된 경우에도 그러하다.<br><br>
          2. 제품과 관련한 고객 또는 제3자의 모든 손해배상청구에 대하여 [펜타시큐리티]는 본 계약에 따라 고객으로부터 수령한 대금의 범위 내에서만 책임을 부담한다.<br><br>
          3. 제품을 통한 이용자의 개인정보(인증수단 포함) 수집은 이용기관의 전적인 책임 및 관리하에 이루어져야 하며, 이용기관은 『정보통신망 이용촉진 및 정보보호 등에 관한 법률』, 『개인정보보호법』 등 관련 법규를 준수하여야 한다. [펜타시큐리티]는 이용자의 어떠한 개인정보도 직접 또는 간접적으로 수집하지 않으며, 이용기관이 이용자로부터 수집하여 관리하는 개인정보(인증수단 포함)에 관하여 대내외적으로 어떠한 책임도 부담하지 않는다.<br><br>

          <p class="chapter">제8조 [보안서약]</p><br>

          [펜타시큐리티]와 고객은 본 계약에 따라 지득한 상대방의 비밀정보(비밀인 것이 표시되어 있거나 공개 시점에서 비밀이라고 특별히 정의된 경우 또는 객관적으로 비밀정보라 판단될 수 있는 상대 당사자의 자산 또는 정보)를 보유하고 본 계약의 이행 또는 본 계약에 근거해 허가되는 목적 달성을 위해서만 사용하는 것에 합의한다. [펜타시큐리티]와 고객은 상대방의 비밀정보에 대한 보호의무를 부담하되, 다음의 정보에 대해서는 그러하지 아니하다.<br><br>
          1. 일반적으로 공개되어 있는 정보<br><br>
          2. 서면으로 증명이 가능한 공개의 시점에서 수령 당사자가 알고 있었던 정보<br><br>
          3. 해당 정보를 공개할 권리를 소유한 제3자로부터 합법적으로 취득한 정보<br><br>
          4. 법률, 정부의 명령 혹은 요청에 의해 공개가 요구되는 정보<br><br>
          상기 내용과 무관하게, 고객은 [펜타시큐리티]의 제품 및 제품관련문서가 비밀정보를 포함하며 비밀정보로 구성되어 있음이 간주됨을 확인하고 이에 합의한다. 본 계약이 해지되는 경우 각 당사자는 자신이 보유, 보관, 관리하는 상대방의 비밀정보 및 그 사본을 즉시 상대방에게 반환하거나 파기하여야 한다.<br><br><br>

          <p class="chapter">제9조 [계약기간 및 계약의 해지]</p><br>

          1. 본 계약은 고객이 최초로 제품을 사용하는 날(이하 “계약발효일”)에 발효되고, 본 계약의 규정에 따라 해지될 때까지 유효하다. 고객 또는 [펜타시큐리티]는 상대방의 계약상 중요한 내용 위반(단 [펜타시큐리티]가 위반의 통지를 수령하고 30일 이내에 위반내용을 시정하는 경우는 제외), 상대방의 지급불능, 상대방에 의한 또는 상대방의 채권자를 위한 본 계약상 권리의 사전 합의 없는 양도, 파산 등에 따른 별도 관리인의 임명 등의 경우 서면에 의한 통지로 본 계약을 해지할 수 있다. 기간 단위의 정액 계약에 따라 고객이 한정적 라이선스를 보유한 경우에는, 당사자 일방이 계약기간 만료 1개월 전까지 상대방에게 갱신 거절의 통지를 하지 아니하면 본 계약이 동일한 조건으로 갱신된 것으로 본다.<br><br>
          2. 본 계약이 해지되는 경우 본 계약에 근거하여 고객에게 부여된 라이선스는 [펜타시큐리티]에 반환되고, 고객은 일체의 제품 사용을 중지하여야 한다. 고객은 해지일로부터 10영업일 이내에 고객이 보유, 관리하는 제품 및 제품관련문서 일체와 그 사본을 파기하거나 [펜타시큐리티]에 반환하며, 고객의 임원은 그 파기 또는 반환을 [펜타시큐리티]에 입증하여야 한다. 고객이 본항의 의무를 준수하지 않는 경우 이는 제품의 부정사용으로 간주되고 [펜타시큐리티]는 이와 관련한 모든 법률상 조치를 취할 수 있다. 본 계약의 해지 후에도 그 성질상 존속이 필요한 본 계약의 모든 조항은 본 계약의 만료 또는 해지 후에도 유효한 것으로 한다.<br><br><br>

          <p class="chapter">제10조 [불가항력]</p><br>
          고객의 대금지급의무를 제외하고, 어떠한 당사자도 천재지변 등 자신의 합리적인 관리가 미치지 못하는 원인에 의한 본 계약상 의무의 이행지연 또는 이행불능으로 인하여 상대방에 대한 책임을 부담하지 않는다. 단 해당 사유로 이행지연 또는 이행불능 상태가 된 당사자는 이를 상대방에게 신속하게 통지하고 의무 이행을 재개하기 위한 합리적인 노력을 기울여야 한다.<br><br><br>

          <p class="chapter">제11조 [고객명칭의 사용]</p><br>

          고객은 [펜타시큐리티]가 광보, 보도, 판매촉진 등의 목적으로 고객의 명칭을 사용하는 것에 동의하되, 이는 고객이 [펜타시큐리티]의 제품을 보증하는 것을 의미하지 아니한다.<br><br><br>

          <p class="chapter">제12조 [양도금지 등]</p><br>

          본 계약은 고객 및 [펜타시큐리티] 각 당사자에 대한 일신전속의 계약이며, 양 당사자의 서면에 의한 사전합의 없이는 본 계약을 양도할 수 없다. 고객이 제3자에게 제품을 임대하거나 제품에 기반한 서비스를 제공하고자 하는 경우에도 이와 같다.<br><br><br>

          <p class="chapter">제13조 [제품정보의 수집 및 사용]</p><br>

          고객은 [펜타시큐리티]가 고객이 사용하는 제품 및 제품의 사용과 관련한 일체의 정보를 수집, 보유, 처리할 수 있음에 동의한다. [펜타시큐리티]는 ICS(Intelligent Customer Support)를 통해 제품과 관련한 소프트웨어 업데이트, 제품 사용 지원, 통계보고서 생성 등의 서비스를 수행하기 위하여 주기적으로 진단적, 기술적 정보 등을 수집하며, 제품 및 서비스 수준 향상을 위해 해당 정보를 사용할 수 있다. [펜타시큐리티]는 고객의 개인정보, 개인정보를 유추해 낼 수 있는 정보, 생체정보, PIN, 패턴, QR, OTP, PKI인증 정보, 위치정보 및 위치정보를 유추해 낼 수 있는 정보는 수집하지 아니한다.<br><br><br>

          <p class="chapter">제14조 [기타사항]</p><br>

          1. 고객은 제품 관리도구의 초기화면에서 언제든지 본 계약의 내용을 확인할 수 있다. [펜타시큐리티]는 제품 및 서비스의 원활한 제공을 위하여 필요한 경우 고객에 대한 사전 통지 없이 본 계약내용 일부를 변경할 수 있다. 그 경우 [펜타시큐리티]는 고객에 대해 변경된 내용을 제품 관리도구를 통해 고지하여야 한다.<br><br>
          2. 본 계약은 양쪽 당사자 간의 완전한 합의로 구성되고, 계약발효일 이전 또는 동시에 본 계약의 주제에 관한 양쪽 당사자간의 모든 합의를 대신하는 것이다.<br><br>
          3. 본 계약에 근거하여 발생하는 분쟁은 고객 및 [펜타시큐리티] 사이의 협의에 의해 가급적 신속하게 약식으로 해결한다. 다만 본항의 내용은 각 당사자의 상대방에 대한 법률상 구제절차를 이행할 권리를 제한하거나 지연하는 것으로 해석되지 아니한다.<br><br>
          4. 본 계약의 내용은 파트너십, 합자회사 또는 대리의 관계 등을 구성하는 것을 의도하지 않는다.<br><br>
          5. 본 계약의 특정 규정이 법령위반 등의 이유로 무효 또는 이행불능이 된 경우에도 그 밖의 규정은 완전한 효력을 가진다.<br><br>
          6. 본 계약에 근거하는 어떠한 권리의 포기도, 다른 사례에 있어서의 같은 또는 다른 권리의 포기로 간주되지 않는다.<br><br>
          7. 본 계약은 대한민국의 법률을 준거법으로 하며, 본 계약에 관련된 일체의 분쟁은 대한민국 서울에 소재하는 서울중앙지방법원에서 해결한다.<br><br>
          8. 제품 및 제품의 사용과 관련하여 필요한 경우, SW DVD Package에 대한 SW 라이선스는 다음의 정책을 따른다.<br><br>
          ● SW DVD Package 내 다음 컴포넌트는 Apache License 2.0을 따른다.<br>
            <p class="tab">- Talend Open Studio for Basic Data Integration</p><br>
          ● SW DVD Package 내 다음 컴포넌트는 GNU 2.0을 따른다.<br>
            <p class="tab">- Filezilla</p>
            <p class="tab">- Wireshark</p><br>
          ● SW DVD Package 내 다음 컴포넌트는 MIT License을 따른다.<br>
            <p class="tab">- PuTTy</p>


        </div>
      </div>
    </div>

    <div class="mt20 mb20 txt_center">
      <input type="button" value="동의" @click="confirm()"
        class="btn_basic btn_cancel bg_bluegreen w80 mr10">
      <input type="button" value="비동의" @click="cancel()"
        class="btn_cancel btn_basic color_indigo btn_outline w80">
    </div>
  </div>
</template>

<script>
export default {
  props: {
    firstLogin: {
      type: Boolean
    }
  },
  mounted () {
    if ((navigator.appName === 'Netscape' && navigator.userAgent.search('Trident') !== -1) || (navigator.userAgent.toLowerCase().indexOf('msie') !== -1)) { // IE 일 경우
      document.getElementById('h_user_agreement').style.position = 'fixed'
      document.getElementById('h_user_agreement').style.width = '650px'
    } else {
      document.getElementById('h_user_agreement').style.position = 'sticky'
      document.getElementById('h_user_agreement').style.top = 0
    }
  },
  methods: {
    confirm: function () {
      this.$emit('close-modal')

      if (this.firstLogin) {
        this.$router.push({ name: 'Setting' })
      }
    },
    cancel: function () {
      this.$emit('close-modal')
    }
  }
}
</script>

<style scoped>
/* Modal */
.modal {
  transition: translateY(0);
  z-index: 999;
  opacity: 1;
}
.modal-card {
  background-color: white;
  border-radius: 0.2rem 0.2rem;
  width: 650px !important;
  height: 520px !important;
  transition: translateY(0);
  z-index: 999;
  opacity: 1;
  overflow-y: auto;
}
.modal-head {
  font-size: 1.5rem;
  font-weight: 400;
  height: 4rem;
  line-height: 4rem;
  padding: 0 2rem;
  border-radius: 0.2rem 0.2rem 0 0;
  color: #fff;
  background-color: #1a2031;
}
.modal-body {
  text-align: left;
  padding: 20px;
  margin: 20px;
  line-height: 3ch;
  background-color: #F2F3F4;
}
.tos {
  text-align: center;
  font-weight: bold;
}
.chapter {
  font-weight: bold;
}
.tab {
  padding-left: 20px;
}
</style>
